## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.longhorn.helm_release.longhorn will be created
  + resource "helm_release" "longhorn" {
      + atomic                     = false
      + chart                      = "longhorn/longhorn"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "longhorn"
      + namespace                  = "longhorn-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.longhorn.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.8.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.longhorn.kubernetes_namespace.longhorn will be created
  + resource "kubernetes_namespace" "longhorn" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "longhorn-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>